using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApplication1
{
    class Figure
    {

         protected List<Point> pList; //обьявляем защищенный список "pList" состоящий из обьектов класса "Point"

        //.........................................................Создаем метод Выводящий содержимое списка "pList" на экран консоли.........................................

        public void Drow()//создаем метод "Drow" который выводит содержимое списка "pList" на экран
        {

            foreach (Point p in pList)
            {
                p.Draww();
            }

        }
        //.....................................................................................................................................................................

        //--------------------------------------------Метод ----------------------------------------------------------------------------------------
        internal bool IsHit(Figure figure)
        {
            foreach (var p in pList)
            {
                if ( figure.IsHit(p) )
                return true;
                
            }

            return false;
        }
        //--------------------------------------------------------------------------------------------------------------------------------------------

        //--------------------------------------------Метод --------(полиморфизм)--------------------------------------------------------------------------------
        private bool IsHit(Point point)
        {
            foreach (var p in pList)
            {
                if (p.IsHit(point))
                    return true;

            }

            return false;
        }
        //--------------------------------------------------------------------------------------------------------------------------------------------



    }
}
