using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApplication1
{


    





class Program
    {

        //%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% процедура вывода заданного символа в заданной координате %%%%%%%(бесцветная)%%%%%%(Вариант_1)%%%%%%%%%%%%%%
        //static void Draww(int X, int Y, int Color, char sym)
        //{

        //    Console.SetCursorPosition(X, Y);//задаем координаты курсора

        //    Console.Write(sym); //выводим курсор на экран в заданных координатах

        //}
        //%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

        //%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% процедура вывода заданного символа в заданной координате %%%%%%%(Цветная)%%%%%%%%(Вариант_2)%%%%%%%%%%%%%
        static void Draww(int X, int Y, int Color, char sym)
        {

            Console.SetCursorPosition(X, Y);//задаем координаты курсора

            if (Color == 1)
            {
                Console.ForegroundColor = ConsoleColor.Green;// 10  "Зеленый цвет текста"
                Console.Write(sym); //выводим курсор на экран в заданных координатах с заданным цветом
            }
            else if (Color == 2)
            {
                Console.ForegroundColor = ConsoleColor.Red;// 12 "Красный цвет текста"
                Console.Write(sym); //выводим курсор на экран в заданных координатах с заданным цветом
            }
            else if (Color == 3)
            {
                Console.ForegroundColor = ConsoleColor.Blue;// 9 " Синий цвет текста"
                Console.Write(sym); //выводим курсор на экран в заданных координатах с заданным цветом
            }
            else if (Color == 4)
            {
                Console.ForegroundColor = ConsoleColor.Yellow; // 14 "Темно желтый цвет текста"
                Console.Write(sym); //выводим курсор на экран в заданных координатах с заданным цветом
            }
            else
            {
                Console.WriteLine("Обычный цвет текста");
            }






           
           

            
            




        }
        //%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

        static void Main(string[] args)   // точка входа в исполнение программы
        {
            ////=============================== организация вывода на экран точки 1    ========
            //int X1 = 2;
            //int Y1 = 7;

            //char sym1 = '*';

            //Console.SetCursorPosition(X1, Y1);//задаем координаты курсора
            //Console.Write(sym1); //выводим курсор на экран в заданных координатах
            ////===============================================================================

            ////================================организация вывода на экран точки 2   ==========
            //int X2 = 10;
            //int Y2 = 10;

            //char sym2 = '#';

            //Console.SetCursorPosition(X2, Y2);//задаем координаты курсора
            //Console.Write(sym2); //выводим курсор на экран в заданных координатах
            ////===============================================================================



            //================== Вывод на экран знаков с помощью процедуры "Draww" ====(бесцветная)=====(Вариант_1)======
            //Draww(5, 5,  'V');

            //Draww(10,10, 'L');

            //Draww(20, 20,'A');

            //Draww(30, 30,'D');

            //Console.ReadLine();
            //===============================================================================


            //================== Вывод на экран знаков с помощью процедуры "Draww" ====(бесцветная)=====(Вариант_2)======
            Draww(5, 5, 1, 'V');

            Draww(10, 10, 2, 'L');

            Draww(20, 20, 3, 'A');

            Draww(30, 30, 4, 'D');

            Console.ReadLine();
            //===============================================================================

        }








    }
}
