using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApplication1
{
    class VerticalLine
    {
        List<Point> pList; //обьявляем список "pList" состоящий из обьектов класса "Point"
        //===========(с возможн.задания произвольных параметров)===== конструктор (метод вызываемый при создании обьекта  класса "HorizontalLine", определяет состояние обьекта тоесть значения переменных )=================
        public VerticalLine(int nachalo_po_x, int konec_po_y, int nachalo_po_y, char sym)
        {
            pList = new List<Point>();//создаем пустой список"pList"

            int dlinna = konec_po_y - nachalo_po_y;//высчитываем количество элементов в линии

            for (int i = 0; i < dlinna; i++)
            {
                Point P = new Point(nachalo_po_x , nachalo_po_y+i, sym);//создаем обект класса "Point", в свою очередь при создании обьектов пользуемся (инкапсулированным) конструктором содержащимся в нутри класса "Point"
                pList.Add(P);
            }
        }
        //======================================================================= конец конструктора ======================================================================================================





        //.........................................................Создаем метод Выводящий содержимое списка "pList" на экран консоли.........................................

        public void Drow()
        {

            foreach (Point element_spiska in pList)
            {
                element_spiska.Draww();
            }
        }
        //.....................................................................................................................................................................



    }
}
