using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApplication1
{
    class Walls  //класс который охватывает создание внешних стенок игры (левой, правой, верхней, нижней)
    {
        List<Figure> wallList;//обьявляем список "wallList" состоящий из обьектов класса "Figure"

        //-------------------конструктор-----------------------------------------------------------------
        public  Walls(int mapWidht/*ширина*/, int mapHeight/*высота*/)
        {
            wallList = new List<Figure>(); //создаем список "wallList" состоящий из обьектов класса "Figure"

            //RRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRR  Создание рамки  для змейки   RRRRRRRRRRR(РАМКА)RRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRR

            //.......................................создание обьекта класса "HorizontalLine" c задаваемыми параметрами координат начала и длинны...................................
            HorizontalLine H_Verx_line = new HorizontalLine(1, mapWidht, 1, '+');//горизонтальная линия верхняя
            wallList.Add(H_Verx_line);//добавляел линию в список
            //....................................................................................................................................................................

            //.......................................создание обьекта класса "HorizontalLine" c задаваемыми параметрами координат начала и длинны...................................
            HorizontalLine H_Niz_line = new HorizontalLine(1, mapWidht, mapHeight, '+');//горизонтальная линия нижняя
            wallList.Add(H_Niz_line);//добавляел линию в список
            //....................................................................................................................................................................

            //.......................................создание обьекта класса "VerticalLine" c задаваемыми параметрами координат начала и длинны...................................
            VerticalLine V_Levaia_line = new VerticalLine(1, mapHeight, 1, '+');//вертикальная линия левая
            wallList.Add(V_Levaia_line);//добавляел линию в список
            //....................................................................................................................................................................

            //.......................................создание обьекта класса "VerticalLine" c задаваемыми параметрами координат начала и длинны...................................
            VerticalLine V_Pravaia_line = new VerticalLine(mapWidht, mapHeight, 1, '+');//вертикальная линия правая
            wallList.Add(V_Pravaia_line);//добавляел линию в список
            //....................................................................................................................................................................

            //RRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRКККККККККККККККККККККККККККККККRRRRRRRRRR(РАМКА)RRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRR

        }
        //-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------


        //--------------------------------------------функция ----------------------------------------------------------------------------------------
        internal bool IsHit(Figure Figure)
        {
           foreach(var wall in wallList)
            {
                if (wall.IsHit(Figure))
                {
                    return true;
                }
            }

            return false;
        }
        //------------------------------------------------------------------------------------------------------------------------------------





        //--------------------- метод -------(вывод на экран нешних границ)------------------------------------------------------------------
        public void Drow()
        {
            foreach (var wall in wallList)

                wall.Drow();

        }
        //------------------------------------------------------------------------------------------------------------------------------------

    }
}
